Repository: jossemarGT/WPMU-dashboard-feedback-button
Catalog: lang/mu-dashboard-feedback-button-*.po
Languages: es_es

source: Network Users Feedback - [WPMU Dashboard Feedback]
es_es: Retroalimentación de usuarios de red - [WPMU Dashboard Feedback]

source: Network Users Feedback
es_es: Retroalimentación de usuarios de red

source: Feedback group
es_es: Grupo de retroalimentación

source: What I liked is...
es_es: Lo que me gusta es...

source: What I didn't like is...
es_es: Lo que no me gusta es...

source: Security check
es_es: Chequeo de seguridad

source: Thanks for your feedback
es_es: Gracias por su comentario

source: Access denied.
es_es: Acceso denegado

source: Let us know what you think
es_es: Permitanos conocer que piensa

source: Shout it!
es_es: Enviar

source: Unread Feedback
es_es: Comentarios sin leer

source: All
es_es: Todo

source: Configuration
es_es: Configuración

source: Negative Feedback
es_es: Comentarios negativos

source: Mark as read
es_es: Marcar como leído

source: Feedback review page options
es_es: Opciones de página de revisión de comentarios

source: Max. quatity of feedback per page
es_es: Máxima cantidad de comentarios por página

source: Toolbar buttons options
es_es: Opciones de botones de retroalimentación en barra de herramientas

source: Disable feedback buttons from toolbar
es_es: Deshablitar botones de feedback

source: Save changes
es_es: Guardar cambios
